# ExportFontKey Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportFontKey Constructor
ExportFontKey Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportFontKey()()()() | Constructs a new default ExportFontKey. |
| ExportFontKey(String) | Constructs a new ExportFontKey using an input font name. |
| ExportFontKey(ExportFontKey) | Constructs a new copy of the input ExportFontKey object. |

# See Also
ExportFontKey Class
ExportFontKey Members
Autodesk.Revit.DB Namespace